[{"id":"/content/posts/journal/2020-05-10-the-first-website/","title":"The first ever website","date":"2020-05-09T22:00:00.000Z","refer":"Tim Berners-Lee´s home page","content":"The first ever website, Tim Berners-Lee´s original home page for the Word Wide Web. Responsive and fast."},{"id":"/content/posts/journal/2020-05-09-fluid-videos-with-my-adaption-of-fitvids/","title":"Fluid videos with my adaption of FitVids","date":"2020-05-08T22:00:00.000Z","content":"Embedded videos are not automatically responsive or fluid. They come with a fixed setting for width and height. To make them responsive while keeping aspect"},{"id":"/content/posts/journal/2020-05-04-10-principles-of-good-design/","title":"The 10 Principles of Good Design","date":"2020-05-03T22:00:00.000Z","content":"Dieter Rams\n\nThe 10 Principles of Good Design as stated by Dieter Rams :\n\nGood design is innovative. The possibilities for innovation are not, by any means,"},{"id":"/content/posts/journal/2020-05-02-2020-week-18/","title":"Weeknotes 18","date":"2020-05-01T22:00:00.000Z","content":"This week I pushed my little website a step further by enhancing the service worker to pre-cache selected pages and by runtime-caching images as well"},{"id":"/content/posts/journal/2020-05-01-google-webfonts-helper/","title":"Google Webfonts Helper ★","date":"2020-04-30T22:00:00.000Z","content":"Mario Ranftl has written the Google Webfonts Helper, which makes self-hosting Google fonts as simple as it possibly can be.\nThe service worker of my website"},{"id":"/content/posts/journal/2020-04-25-2020-week-17/","title":"Weeknotes 17","date":"2020-04-24T22:00:00.000Z","content":"I´ve created my first service worker and turned my website into a Progressive Web App 💪. After doing some precaching for static resources (JavaScript, CSS,"},{"id":"/content/posts/journal/2020-04-20-tel-aviv-social-distancing/","title":"Social distancing while protesting","date":"2020-04-19T22:00:00.000Z","content":"A photo taken by Tomer Appelbaum, showing thousands of Israelis maintain social distancing while protesting Natanyahu in Tel Aviv´s Rabin sq. I took the photo"},{"id":"/content/posts/journal/2020-04-18-2020-Week-16/","title":"Weeknotes 16","date":"2020-04-17T22:00:00.000Z","content":"Emil draws \" Ladybirds, fairy dust, and witches on witches broomsticks.\"\nAs of this week, Germany has 138,221 infected people and 4,098 people died on COVID-19."},{"id":"/content/posts/journal/2020-04-11-2020-Week-15/","title":"Weeknotes 15","date":"2020-04-10T22:00:00.000Z","content":"Emil discovers the luxury of whitespace.\nKristian Lumme describes the collaborative approach of Fournova, who are the makers of Tower for Git. Article \" How We"},{"id":"/content/posts/journal/2020-04-10-newspaper-designs-during-the-pandemic/","title":"Newspaper designs during the pandemic","date":"2020-04-09T22:00:00.000Z","content":"Some remarkable newspaper designs I got aware of via Twitter. Michael Bierut pointed me towards the handwritten front page designs of the New York Times.\n\nA"},{"id":"/content/posts/journal/2020-04-09-website-accessibility-got-worse/","title":"Website accessibility got worse","date":"2020-04-08T22:00:00.000Z","content":"Dave Rupert made me aware with his tweet :\n\nThe average website accessibility got worse during the last twelve months!\n\nThis is according to the WebAIM annual"},{"id":"/content/posts/journal/2020-04-04-2020-Week-14/","title":"Weeknotes 14","date":"2020-04-03T22:00:00.000Z","content":"Emil draws \" Snakes with Poison Dots.\"\nMax Böck published a boilerplate Emergency Website Kit, which, especially these days, aims to provide a quick way to"},{"id":"/content/posts/journal/2020-03-28-an-rss-feed-for-github-pages/","title":"An RSS feed for GitHub Pages","date":"2020-03-27T23:00:00.000Z","content":"RSS is a good thing. It simplifies to overview information that is produced by potentially many different sources. If someone has an RSS feed on"},{"id":"/content/posts/journal/2020-03-22-2020-week-13/","title":"Weeknotes 13","date":"2020-03-21T23:00:00.000Z","content":"Write personal: \" Into the Personal-Website-Verse\" is a plea for personal websites from Matthias Ott. That gets a ★. \" Advice from Ten Years of"},{"id":"/content/posts/journal/2020-03-22-2020-Week-12/","title":"Weeknotes 12","date":"2020-03-21T23:00:00.000Z","content":"Emil pictured the virus.\nI get the case counts from The Johns Hopkins Coronavirus Resource Center. At the end of this week we are counting 22.000"},{"id":"/content/posts/journal/2020-03-09-2020-Week-11/","title":"Weeknotes 11","date":"2020-03-08T23:00:00.000Z","content":"This guy Jack McDade knows how to design a web page. Jack made Justin Jackson´s page, which I think is an exceptional piece of work."},{"id":"/content/posts/journal/2020-03-02-2020-week-10/","title":"Weeknotes 10","date":"2020-03-01T23:00:00.000Z","content":"Watched \" Thereabouts 3: Discovering Colombia\" again. It´s the best of the series. I can recommend this film for anyone who is into cycling.\nRestarted my"},{"id":"/content/posts/journal/2020-02-24-2020-week-9/","title":"Weeknotes 9","date":"2020-02-23T23:00:00.000Z","content":"Signed assange-helfen. A state has been caught in a war crime and for that reason the state takes revenge on the person who helped to"},{"id":"/content/posts/articles/2017-11-15-splitting-user-stories/","title":"Splitting User Stories","date":"2017-11-14T23:00:00.000Z","abstract":"A User Story can cover vast amounts of functionality with a single sentence, which requires a team many weeks or even months of work to get it done (often called epic). Splitting such stories into pieces which are valuable for users and still deliverable within a Sprint is challenging for many teams. However, there are good reasons why you should do it.","content":"User Stories are short and simple descriptions of a feature told from the perspective of the person who desires the new capability, usually a user"},{"id":"/content/posts/articles/2017-02-26-balanced-organization/","title":"The balanced organization","date":"2017-02-25T23:00:00.000Z","abstract":"The agile manifesto defines a collaboration culture. But what if your current environment is not collaborative? This article describes alternatives to move into the agile direction.","content":"Core cultures\nIn the agile movement, many consider a collaboration culture as a worthwhile goal for any organization and even further assume the members of those"},{"id":"/content/posts/articles/2016-04-23-pocket-git-guide/","title":"Pocket Git Guide","date":"2016-04-22T22:00:00.000Z","subtitle":"A short entry-level approach to Git","abstract":"A short entry-level approach to Git.","content":"Contents\n\nReasons to use Git\nGet Git on your Mac\nGet Git on Windows\nThe Git shell\nTell Git who you are\nGet help from Git\nCreate a new local repository\nStatus of"},{"id":"/content/posts/articles/2015-07-24-supersize/","title":"Supersize","date":"2015-07-23T22:00:00.000Z","subtitle":"Do not let scaled agile be your scaled snake oil","content":"We have to scale agile when more than one team is required to get a thing delivered. Each team, not more than ten members. There"},{"id":"/content/posts/articles/2013-03-26-self-organization/","title":"Self-organization","date":"2013-03-25T23:00:00.000Z","subtitle":"A force of life","content":"Self-organization is the determining element for agile teams and companies. To think and act accordingly requires the acceptance of evolutionary forces which are an inherent"},{"id":"/content/posts/articles/2013-02-01-the-agile-worker/","title":"The agile worker","date":"2013-01-31T23:00:00.000Z","subtitle":"The agile worker exists because of discrepancies between theory and reality","abstract":"The agile worker exists because differences exist between theory and reality and because insights can be gained through these discrepancies.","content":"An essential part of agile work is learning. Agile workers are knowledge workers who bring their mental models in contact with reality. The agile worker"},{"id":"/content/posts/articles/2012-08-31-art-in-work/","title":"The art in our work","date":"2012-08-30T22:00:00.000Z","subtitle":"Challenging the status quo is art","abstract":"The Agile Manifesto represents a force that is behind any particular agile procedure like XP, Scrum or Kanban. This force, the culture to challenge the status quo, attracts certain people and companies.","content":"This text was first published in OBJEKTspektrum, issue 5/2012, under the title\"Die Kunst in der Arbeit, eine Herausforderung des Status quo\". I have enhanced and"},{"id":"/content/posts/articles/2012-07-10-five-dysfunctions/","title":"Five dysfunctions of a team","date":"2012-07-09T22:00:00.000Z","subtitle":"A non-performing team is not a team","content":"Deliver with each iteration a done piece of work and collaborate as a team. If you do only these two things and forget about all"},{"id":"/content/posts/articles/2012-07-03-definition-of-done/","title":"Definition of Done","date":"2012-07-02T22:00:00.000Z","subtitle":"A contract to begin your agile journey with","content":"The Definition of Done (DoD) is not only a checklist that has to be executed to get a piece of work delivered. The DoD and"},{"id":"/content/posts/articles/2011-06-27-scrum-and-architecture/","title":"Scrum and Architecture","date":"2011-06-26T22:00:00.000Z","subtitle":"The architect and his tools in the Scrum process","abstract":"Cooperatively making architectural decisions, at a point in time when they are needed – and not earlier – is a quality-improving paradigm in agile software development. Conceptual integrity in the flow of architecture decisions will only be achieved if one person has the final word regarding those decisions. This is the architect, serving the product, whose rights and obligations in the context of the Scrum process are being reflected in this essay.","content":"This text was first published in OBJEKTspektrum, issue 4/2011, under the title\"Scrum und Architektur, konzeptionelle Integrität im Scrum Prozess\". I have reworked, enhanced and translated"},{"id":"/bbl/","title":"The Box-Bullet-Line (BBL)","date":"2011-04-13T22:00:00.000Z","subtitle":"An intuitive and natural notation to communicate flows between components","abstract":"An intuitive and natural notation to communicate flows between components.","content":"Many important aspects of software development are invisible. When creating software we work through different abstraction layers by analyzing symbols and writing code.\nWriting software is"},{"id":"/content/posts/articles/2011-04-09-a-sprint-is-not-a-milestone/","title":"A Sprint is not a milestone","date":"2011-04-08T22:00:00.000Z","abstract":"A Sprint is a sensor that allows us to see what has been done, what impediments are in our way and how we did better in comparison to previous Sprints.","content":"By using Scrum, we deliver \"things\" in a rhythm that is given by so-called Sprints. Sprints should be of the same duration (for example two"}]